0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (10 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            slip;
    }
    
    body
    {
    	type		noSlip;
    }
    
    optSurface
    {
    	type		noSlip;
    }
    
    wheelFL
    {
	type		noSlip;
    } 
    
    wheelRL
    {
	type		noSlip;
    } 
       
    symmetry
    {
    	type 		symmetry;
    }
    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
