0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }
    
    body
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
    
    optSurface
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
    
    wheelFL
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
    
    wheelRL
    {
        type            fixedValue;
        value           uniform 1e-16;
    }
    
    symmetry
    {
    	type 		symmetry;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
