system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://www.openfoam.com
    \\  /    A nd           | Version:  v1812
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0  0  0)    // 0
    (75 0  0)    // 1
    (75 10  0)    // 2
    (0  10  0)    // 3

    (0  0  10)    // 4
    (75 0  10)    // 5
    (75 10  10)    // 6
    (0  10  10)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (100 15 15)
    simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    name background;
    type internal;
}

boundary
(
inlet
    {
        type inlet;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type outlet;
        faces
        (
            (1 5 6 2)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (0 4 5 1)
	    (3 2 6 7)
	    (4 7 6 5)
        );
    }
    
    symmetry
    {
	type symmetry;
	faces
	(	
		(0 1 2 3)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
