system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    body.stl
    {
        type triSurfaceMesh;
	name body;
    }
    
    optSurface.stl
    {
        type triSurfaceMesh;
	name optSurface;
    }
    
    wheelFL.stl
    {
        type triSurfaceMesh;
	name wheelFL;
    }
    
    wheelRL.stl
    {
        type triSurfaceMesh;
	name wheelRL;
    }
    
    box1
    {
    	type searchableBox;
        min (17.5 0 0);
        max (60 5 4);
   }
   
    box2
    {
    	type searchableBox;
        min (21 0 0);
        max (45 3.5 3);
   }
   
    box3
    {
    	type searchableBox;
        min (24 0 0);
        max (36 2.5 2);
   }

    box4
    {
    	type searchableBox;
	min (25 0 0);
	max (30 0.2 0.95);
    }
};

castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 5000000;
    minRefinementCells 0;
    nCellsBetweenLevels 3;
    
    features
    (
    	{
		file "../extendedFeatureEdgeMesh/body_edgeMesh.obj";
		level 5;
	}

	{
                file "../extendedFeatureEdgeMesh/optSurface_edgeMesh.obj";
                level 4;
        }

	{
                file "../extendedFeatureEdgeMesh/wheelFL_edgeMesh.obj";
                level 4;
        }

	{
                file "../extendedFeatureEdgeMesh/wheelRL_edgeMesh.obj";
                level 4;
        }
    
    );

    refinementSurfaces
    {
        body
        {
            level (5 5);
        }
        
	optSurface
        {
            level (5 5);
        }
        
	//wheelFL
        //{
        //    level (4 5);
        //}
        
	//wheelRL
        //{
        //    level (4 5);
        //}
    }

    refinementRegions
    {
       /*box1
       {
             mode inside;
             levels ((1 1));
       }
       
       box2
       {
             mode inside;
             levels ((2 2));
       }

       box3
       {
             mode inside;
             levels ((3 3));
       }*/

       //box4
       //{
       //	   mode inside;
	//	   levels ((6 6)); 
      // }
    }

    locationInMesh	(15 1e-5 1e-5);
    
    allowFreeStandingZoneFaces true;
}

snapControls
{

    nSmoothPatch 10;
    tolerance 0.5;
    nSolveIter 300;
    nRelaxIter 10;
    nFeatureSnapIter 20;     // More feature snapping
    implicitFeatureSnap false;  // Better edge detection
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;

    // Quality controls during snapping
    //nSmoothDisplacement 5;    // Smooth point movement
    //nSmoothNormals 3;         // Smooth surface normals
}

addLayersControls
{
    relativeSizes false;
    layers
    {
        body
        {
            nSurfaceLayers 3;
        }

        optSurface
        {
            nSurfaceLayers 3;
        }

        wheelFL
        {
            nSurfaceLayers 0;
        }

        wheelRL
        {
            nSurfaceLayers 0;
        }
    }

    expansionRatio 1.2;
    finalLayerThickness 0.01;
    minThickness 0.001;
    nGrow 0;

    // Advanced settings
    featureAngle 100;
    nRelaxIter 10;
    nSmoothSurfaceNormals 10;
    nSmoothNormals 10;
    nSmoothThickness 10;
    maxFaceThicknessRatio 1;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 130;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-15;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;


    // Advanced

    nSmoothScale 4;
    errorReduction 0.75;
}

debug 0;

mergeTolerance 1e-6;

// ************************************************************************* //
